# Terraform plan for staging
  
  ```
  Plan: 3 to add, 0 to change, 3 to destroy
  ```

  <details>
  <summary>Terraform Plan Details</summary>

  ```
  module.workload_identity_pool.google_iam_workload_identity_pool.default: Refreshing state... [id=projects/stg-piny940/locations/global/workloadIdentityPools/default-pool]
module.workload_identity_pool.google_project_service.iamcredentials: Refreshing state... [id=stg-piny940/iamcredentials.googleapis.com]
module.clubroom.google_storage_bucket.clubroom: Refreshing state... [id=stg-clubroom.piny940.com]
google_storage_bucket.terraform_remote_backend: Refreshing state... [id=stg-terraform-remote-backend.piny940.com]
module.terraform.google_service_account.terraform_github_actions: Refreshing state... [id=projects/stg-piny940/serviceAccounts/terraform-github-actions@stg-piny940.iam.gserviceaccount.com]
module.terraform.google_iam_workload_identity_pool_provider.terraform_github_actions: Refreshing state... [id=projects/stg-piny940/locations/global/workloadIdentityPools/default-pool/providers/terraform-github-actions]
module.terraform.google_service_account_iam_member.terraform_github_actions_workload_identity_user: Refreshing state... [id=projects/stg-piny940/serviceAccounts/terraform-github-actions@stg-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/default-pool/subject/repo:piny940/infra:environment:staging]
module.terraform.google_project_iam_member.terraform_github_actions_editor: Refreshing state... [id=stg-piny940/roles/owner/serviceAccount:terraform-github-actions@stg-piny940.iam.gserviceaccount.com]
module.terraform.google_project_iam_member.terraform_github_actions_workload_identity_user: Refreshing state... [id=stg-piny940/roles/iam.workloadIdentityUser/serviceAccount:terraform-github-actions@stg-piny940.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.terraform.google_iam_workload_identity_pool_provider.terraform_github_actions must be replaced
-/+ resource "google_iam_workload_identity_pool_provider" "terraform_github_actions" {
      - disabled                           = false -> null
      ~ id                                 = "projects/stg-piny940/locations/global/workloadIdentityPools/default-pool/providers/terraform-github-actions" -> (known after apply)
      ~ name                               = "projects/645068243364/locations/global/workloadIdentityPools/default-pool/providers/terraform-github-actions" -> (known after apply)
      ~ state                              = "ACTIVE" -> (known after apply)
      ~ workload_identity_pool_id          = "default-pool" -> "default" # forces replacement
        # (6 unchanged attributes hidden)

      ~ oidc {
          - allowed_audiences = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.terraform.google_service_account_iam_member.terraform_github_actions_workload_identity_user must be replaced
-/+ resource "google_service_account_iam_member" "terraform_github_actions_workload_identity_user" {
      ~ etag               = "BwYhzJ67Y4Y=" -> (known after apply)
      ~ id                 = "projects/stg-piny940/serviceAccounts/terraform-github-actions@stg-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/default-pool/subject/repo:piny940/infra:environment:staging" -> (known after apply)
      ~ member             = "principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/default-pool/subject/repo:piny940/infra:environment:staging" -> "principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/default/subject/repo:piny940/infra:environment:staging" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.workload_identity_pool.google_iam_workload_identity_pool.default must be replaced
-/+ resource "google_iam_workload_identity_pool" "default" {
      - disabled                  = false -> null
      ~ id                        = "projects/stg-piny940/locations/global/workloadIdentityPools/default-pool" -> (known after apply)
      ~ name                      = "projects/645068243364/locations/global/workloadIdentityPools/default-pool" -> (known after apply)
      ~ state                     = "ACTIVE" -> (known after apply)
      ~ workload_identity_pool_id = "default-pool" -> "default" # forces replacement
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
  ```

  </details>
Please apply the changes to the staging environment using the [Terraform apply workflow](https://github.com/piny940/infra/actions/workflows/tf-apply.yaml)
